# IsAdaptivePlacementPoint Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdaptiveComponentFamilyUtils..::..IsAdaptivePlacementPoint Method
AdaptiveComponentFamilyUtils Class See Also
---
Verifies if the Reference Point is an Adaptive Placement Point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static bool IsAdaptivePlacementPoint(
	Document doc,
	ElementId refPointId
)
```

Visual Basic
---
```text
Public Shared Function IsAdaptivePlacementPoint ( _
	doc As Document, _
	refPointId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsAdaptivePlacementPoint(
	Document^ doc,
	ElementId^ refPointId
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document The Document
refPointId
    Type: Autodesk.Revit.DB..::..ElementId The ReferencePoint id
# ### Return Value
True if the Point is an Adaptive Placement Point.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AdaptiveComponentFamilyUtils Class
Autodesk.Revit.DB Namespace